Repository: KDE/step
Catalog: po/*/step_objinfo_files.po
Languages: ar, de, eo

# linearmotor.html:p
source: You can set the desired linear force for an object by changing the force value in the properties browser.
ar: اضبط القوة الخطية المطلوبة لجسم ما بتغيير قيمة القوة في متصفح الخصائص.
de: Sie können Richtung und Wert der Kraft im Eigenschaftenbrowser oder mit der Maus einstellen.
eo: Vi povas agordi la deziratan linearan forton por objekto ŝanĝante la fortovaloron en la retumilo de proprietoj.

# meter.html:title
source: Meter
ar: مقياس
de: Messwert
eo: Metro

# meter.html:p
source: A meter can show you values of properties. The meter can be configured to show property of any given object of the simulation.
ar: يمكن للمقياس أن يعرض لك قيم الخصائص. يمكن اضبط المقياس لعرض خاصية أي جسم معين في المحاكاة.
de: Ein Messwert zeigt den Wert von Eigenschaften an. Der Messwert kann eingerichtet werden, um die Eigenschaften jedes beliebigen Objekts in der Simulation anzuzeigen.
eo: Metro povas montri al vi valorojn de propraĵoj. La mezurilo povas esti agordita por montri posedaĵon de iu antaŭfiksita objekto de la simulado.

# note.html:title
source: Note
ar: مذكرة
de: Notiz
eo: Noto

# note.html:p
source: You can use notes to place text on the canvas of Step.
ar: استعمل المذكرات لوضع نص على لوح رسم خطوة.
de: Verwenden Sie Notizen, um Text im Versuchsfenster anzuzeigen.
eo: Vi povas uzi notojn por meti tekston sur la tolon de Step.

# particle.html:title
source: Particle
ar: جسيم
de: Teilchen
eo: Partiklo

# particle.html:p
source: A zero-sized particle which has a unique name and four parameters:
ar: جسيم صفر الحجم له اسم فريد وأربع معلمات:
de: Ein Teilchen ohne Ausdehnung mit einem eindeutigen Namen und vier Parametern:
eo: Nul-granda partiklo kiu havas unikan nomon kaj kvar parametrojn:

# particle.html:body
source: <ul> <li><b>position:</b> The X/Y position of the particle, relative to the center of the <a href="objinfo:World">world</a>.</li> <li><b>velocity:</b> the velocity of the particle. Unit: meters/second.</li> <li><b>force:</b> the force with which the particle is moving around.</li> <li><b>mass:</b> the mass of the particle. This influences forces with which the particle interacts with other items.</li> </ul>
ar: <ul> <li><b>الموضع:</b> الموضع X/Y للجسيم، نسبة إلى مركز <a href="objinfo:World">العالم</a>.</li> <li><b>السرعة:</b> سرعة الجسيم. الوحدة: متر/ثانية.</li> <li><b>القوة:</b> القوة التي يتحرك بها الجسيم حوله.</li> <li><b>الكتلة:</b> كتلة الجسيم. يؤثر هذا على القوى التي يتفاعل بها الجسيم مع العناصر الأخرى.</li> </ul>
de: <ul> <li><b>Position:</b> Die X- und Y-Position des Teilchens, relativ zum Zentrum der <a href="objinfo:World">Welt</a>.</li> <li><b>Geschwindigkeit:</b> Die Geschwindigkeit des Teilchen in Meter/Sekunde.</li> <li><b>Kraft:</b> Die Kraft mit der das Teilchen bewegt wird.</li> <li><b>Masse:</b> Die Masse des Teilchens. Sie beeinflusst die Kräfte, mit der das Teilchen auf andere Objekten wirkt.</li> </ul>
eo: <ul> <li><b>pozicio:</b> La X/Y pozicio de la partiklo, relative al la centro de la <a href="objinfo:World">mondo</a>.</li> <li><b>rapideco:</b> la rapideco de la partiklo. Unuo: metroj/sekundo.</li> <li><b>forto:</b> la forto per kiu la partiklo moviĝas ĉirkaŭe.</li> <li><b>maso:</b> la maso de la partiklo. Ĉi tio influas fortojn kun kiuj la partiklo interagas kun aliaj eroj.</li> </ul>

# pin.html:title
source: Pin
ar: دبوس
de: Stift
eo: Pinglo

# pin.html:p
source: A pin is a joint that fixes a particular point of the body, The body can still move around the pin.
ar: الدبوس هو وصل يثبت نقطة معينة من الجسم. يمكن للجسم أن يتحرك حول الدبوس.
de: Ein Stift fixiert die Position eines Punktes auf einem Körper. Der Körper kann sich noch um den Stift drehen.
eo: Pinglo estas artiko, kiu fiksas apartan punkton de la korpo, La korpo ankoraŭ povas moviĝi ĉirkaŭ la pinglo.

# polygon.html:title
source: Polygon
ar: مضلع
de: Vieleck
eo: Plurangulo

# polygon.html:p
source: A rigid polygon with a unique name and the following parameters:
ar: مضلع صلب له اسم فريد والمعلمات الآتية:
de: Ein starres Vieleck mit einem eindeutigen Namen und folgenden Parametern:
eo: Rigida plurlatero kun unika nomo kaj la sekvaj parametroj:

# polygon.html:body
source: <ul> <li><b>position:</b> The X/Y position of the center of mass of the polygon, relative to the center of the <a href="objinfo:World">world</a>.</li> <li><b>angle:</b> By how much the polygon is rotated in positive direction, that is clock-wise.</li> <li><b>velocity:</b> The velocity of the center of mass of the polygon. Unit: meters/second.</li> <li><b>angular velocity:</b> How fast the polygon is spinning in positive direction, that is clock-wise.</li> <li><b>mass:</b> Total mass of the polygon. This influences forces with which the polygon interacts with other items.</li> <li><b>inertia:</b> How difficult it is to change the polygon's rotation.</li> <li><b>momentum:</b> A fundamental quantity in mechanics that is conserved in the absence of external forces. A product of the mass and the velocity.</li> <li><b>angular momentum:</b> Measure of the extent to which the polygon will continue to rotate unless acted upon by an external torque.</li> <li><b>kinetic energy:</b> The work needed to accelerate the body of a given mass from rest to its current velocity.</li> <li><b>vertexes:</b> A list of vertexes (corners) of the polygon, which define its size and shape. Coordinates of each vertex are relative to the center of mass of the polygon.</li> </ul>
ar: <ul> <li><b>الموضع:</b> الموضع X/Y لمركز كتلة المضلع، نسبة إلى مركز <a href="objinfo:World">العالم</a>.</li> <li><b>الزاوية:</b> مقدار دوران المضلع في الاتجاه الموجب، وهو اتجاه عقارب الساعة.</li> <li><b>السرعة:</b> سرعة مركز كتلة المضلع. الوحدة: متر/ثانية.</li> <li><b>السرعة الزاوية:</b> سرعة دوران المضلع في الاتجاه الموجب، وهو اتجاه عقارب الساعة.</li> <li><b>الكتلة:</b> الكتلة الكلية للمضلع. يؤثر هذا على القوى التي يتفاعل بها المضلع مع العناصر الأخرى.</li> <li><b>القصور الذاتي:</b> مدى صعوبة تغيير دوران المضلع.</li> <li><b>كمية الحركة:</b> كمية أساسية في الميكانيكا محفوظة في غياب القوى الخارجية. ناتج ضرب الكتلة في السرعة.</li> <li><b>كمية الحركة الزاوية:</b> قياس المدى الذي سيستمر فيه المضلع بالدوران ما لم تؤثر عليه عزوم خارجية.</li> <li><b>الطاقة الحركية:</b> الشغل اللازم لتسريع جسم له كتلة معينة من السكون إلى سرعته الحالية.</li> <li><b>رؤوس:</b> قائمة برؤوس (زوايا) المضلع، التي تحدد حجمه وشكله. إحداثيات كل رأس نسبية إلى مركز كتلة المضلع.</li> </ul>
eo: <ul> <li><b>pozicio:</b> La X/Y-pozicio de la centro de maso de la plurangulo, relative al la centro de la <a href="objinfo:World ">mondo</a>.</li> <li><b>angulo:</b> Kiom la plurlatero turniĝas en pozitiva direkto, tio estas horloĝe.</li> <li><b>rapideco:</b> La rapideco de la centro de maso de la plurangulo. Unuo: metroj/sekundo.</li> <li><b>angula rapido:</b> Kiom rapide la plurangulo turniĝas en pozitiva direkto, tio estas horloĝe.</li> <li><b>maso:</b> Tuta maso de la plurangulo. Ĉi tio influas fortojn kun kiuj la plurangulo interagas kun aliaj eroj.</li> <li><b>inercio:</b> Kiel malfacile estas ŝanĝi la rotacion de la plurangulo.</li> <li><b>momento:</b> Fundamenta kvanto en mekaniko, kiu konserviĝas en foresto de eksteraj fortoj. Produto de la maso kaj la rapido.</li> <li><b>angula movokvanto:</b> Mezuro de la mezuro al kiu la plurangulo daŭros turni, krom se agado de ekstera tordmomanto.</li> <li><b>kineta energio:</b> La laboro necesa por akceli la korpon de difinita maso de ripozo ĝis ĝia nuna rapido.</li> <li><b>verticoj:</b> Listo de verticoj (anguloj) de la plurangulo, kiuj difinas ĝian grandecon kaj formon. Koordinatoj de ĉiu vertico estas relative al la centro de maso de la plurangulo.</li> </ul>

# softbody.html:title
source: Soft body
ar: جسم رخو
eo: Mola korpo

# softbody.html:p
source: A soft body is a collection of <a href="objinfo:particle">particles</a> connected by <a href="objinfo:spring">springs</a>. This can be used to simulate an <a href="https://en.wikipedia.org/wiki/Elasticity_(physics)">elastic</a> or viscoelastic body.
ar: الجسم الرخو هو مجموعة من <a href="objinfo:particle">الجسيمات</a> متصلة بواسطة <a href="objinfo:spring">نوابض</a>. يمكن استعمال هذا لمحاكاة جسم <a href="https://en.wikipedia.org/wiki/Elasticity_(physics)">مرن</a> أو مرن لزج.
eo: Mola korpo estas kolekto de <a href="objinfo:particle">partikloj</a> ligitaj per <a href="objinfo:spring">risortoj</a>. Ĉi tio povas esti uzata por simuli <a href="https://en.wikipedia.org/wiki/Elasticity_(physics)">elastan</a> aŭ viskoelastan korpon.

# spring.html:title
source: Spring
ar: نابض
eo: Risorto

# spring.html:p
source: A flexible elastic object to store mechanical energy. It has a unique name and the following parameters:
ar: جسم مرن مرن لتخزين الطاقة الميكانيكية. له اسم فريد والمعلمات الآتية:
eo: Fleksebla elasta objekto por stoki mekanikan energion. Ĝi havas unikan nomon kaj la sekvajn parametrojn:

# spring.html:body
source: <ul> <li><b>rest length:</b> is the length of the spring as it is not compressed or stretched.</li> <li><b>length:</b> is the initial spring length</li> <li><b>stiffness:</b> is the level of spring resistance to compression or stretching</li> <li><b>damping:</b> is level of spring ability to disperse stored energy, an internal viscosity</li> <li><b>body 1 and 2:</b> are the bodies to which the spring is fixed</li> <li><b>local position 1 and 2:</b> are the local positions of the spring ends relative to its center in the non-deformed state</li> <li><b>position 1 and 2:</b> are the global positions of the spring ends</li> <li><b>force:</b> is the force that acts along the spring</li> </ul>
ar: <ul> <li><b>طول الاستراحة:</b> هو طول النابض عندما لا يكون مضغوطًا أو ممتدًا.</li> <li><b>الطول:</b> هو الطول المبدئي للنابض</li> <li><b>الصلابة:</b> هي مستوى مقاومة النابض للضغط أو التمدد</li> <li><b>التخميد:</b> هو مستوى قدرة النابض على تشتيت الطاقة المخزونة، وهي لزوجة داخلية</li> <li><b>الجسمان 1 و 2:</b> هما الجسمان اللذان ثُبت بهما النابض</li> <li><b>الموضع المحلي 1 و 2:</b> هما الموضعان المحليان لنهايتي النابض نسبة إلى مركزه في الحالة غير المشوهة</li> <li><b>الموضع 1 و 2:</b> هما الموضعان العموميان لنهايتي النابض</li> <li><b>القوة:</b> هي القوة التي تؤثر على طول النابض</li> </ul>
eo: <ul> <li><b>ripozolongo:</b> estas la longo de la risorto ĉar ĝi ne estas kunpremita aŭ streĉita.</li> <li><b>longo:</b> estas la komenca risorta longo</li> <li><b>rigideco:</b> estas la nivelo de risorta rezisto al kunpremado aŭ streĉado</li> <li><b>malseketiĝo:</b> estas nivelo de risorta kapablo disvastigi stokitan energion, internan viskozecon</li> <li><b>korpoj 1 kaj 2 :</b> estas la korpoj, al kiuj la risorto estas fiksita</li> <li><b>loka pozicio 1 kaj 2:</b> estas la lokaj pozicioj de la risortaj finaĵoj rilate al ĝia centro en la nedeformita stato</li> <li><b>pozicio 1 kaj 2:</b> estas la tutmondaj pozicioj de la risortaj finaĵoj</li> <li><b>forto:</b> estas la forto kiu agas laŭ la risorto</li> </ul>

# weightforce.html:title
source: Weight Force
ar: قوة الوزن
eo: Pezo-Forto

# weightforce.html:p
source: Weight of an object is the force exerted on it by gravity.
ar: وزن الجسم هو القوة التي تؤثر عليه بالجاذبية.
eo: Pezo de objekto estas la forto penita sur ĝi de gravito.

# weightforce.html:p
source: Weight is a vector quantity. It is often denoted by W and given by the relation W = mg.
ar: الوزن كمية متجهة. غالبًا ما يُشار إليه بالرمز W و يُعطى بالعلاقة W = mg.
eo: Pezo estas vektora kvanto. Ĝi estas ofte indikita per W kaj donita per la rilato W = mg.

# weightforce.html:body
source: <li>Where, <b>m</b> is the mass of the body</li> <li>and <b>g</b> is the acceleration due to gravity.</li>
ar: <li>حيث، <b>m</b> هي كتلة الجسم</li> <li>و <b>g</b> هي التسارع الناتج عن الجاذبية.</li>
eo: <li>Kie, <b>m</b> estas la maso de la korpo</li> <li>kaj <b>g</b> estas la akcelo pro gravito.</li>

# weightforce.html:p
source: For more details, please refer to the <a href="https://en.wikipedia.org/wiki/Weight">Weight Force</a>.
ar: لمزيد من التفاصيل، يرجى الرجوع إلى <a href="https://en.wikipedia.org/wiki/Weight">قوة الوزن</a>.
eo: Por pliaj detaloj, bonvolu raporti al la <a href="https://en.wikipedia.org/wiki/Weight">Pezforto</a>.

# world.html:title
source: World
ar: العالم
eo: mondo

# world.html:p
source: This is the world scene. From the objects palette you should pick some items and put them on the canvas. After you set properties of objects you can click on the <b>Simulate</b> button in toolbar and your scene will evolve according to the laws of physics.
ar: هذا هو مشهد العالم. من لوحة الكائنات اختر بعض العناصر و ضعها على لوح الرسم. بعد أن تضبط خصائص الكائنات، انقر على زر <b>حاكِ</b> في شريط الأدوات وسيتطور مشهدك وفقًا لقوانين الفيزياء.
eo: Jen la monda sceno. El la objekta paletro vi devas elekti kelkajn erojn kaj meti ilin sur la kanvason. Post kiam vi fiksis ecojn de objektoj, vi povas alklaki la butonon <b>Simuli</b> en ilobreto kaj via sceno evoluos laŭ la leĝoj de fiziko.
