Repository: KDE/step
Catalog: po/*/step_objinfo_files.po
Languages: ar, de, eo

# anchor.html:title
source: Anchor
ar: مثبت
de: Anker
eo: Ankro

# anchor.html:p
source: Anchor is a joint that fixes position of the body. The body can not move when it has an anchor.
ar: المثبت هو وصل يثبت موضع الجسم. لا يمكن للجسم أن يتحرك عندما يكون له مثبت.
de: Ein Anker fixiert die Position eines Körpers. Ein Körper mit einem Anker kann nicht mehr bewegt werden.
eo: Ankro estas artiko, kiu fiksas pozicion de la korpo. La korpo ne povas moviĝi kiam ĝi havas ankron.

# box.html:title
source: Box
ar: صندوق
de: Rechteck
eo: Skatolo

# box.html:p
source: A rigid box with a unique name and the following parameters:
ar: صندوق صلب له اسم فريد و المعلمات الآتية:
de: Ein starres Rechteck mit einem eindeutigen Namen und folgenden Parametern:
eo: Rigida skatolo kun unika nomo kaj la sekvaj parametroj:

# box.html:body
source: <ul> <li><b>position:</b> The X/Y position of the center of mass of the box, relative to the center of the <a href="objinfo:World">world</a>.</li> <li><b>angle:</b> By how much the box is rotated in positive direction, that is clock-wise.</li> <li><b>velocity:</b> The velocity of the center of mass of the box. Unit: meters/second.</li> <li><b>angular velocity:</b> How fast the box is spinning in positive direction, that is clock-wise.</li> <li><b>mass:</b> Total mass of the box. This influences forces with which the box interacts with other items.</li> <li><b>inertia:</b> How difficult it is to change the box's rotation.</li> <li><b>momentum:</b> A fundamental quantity in mechanics that is conserved in the absence of external forces. A product of the mass and the velocity.</li> <li><b>angular momentum:</b> Measure of the extent to which the box will continue to rotate unless acted upon by an external torque.</li> <li><b>kinetic energy:</b> The work needed to accelerate the body of a given mass from rest to its current velocity.</li> <li><b>size:</b> Defines width and height of the box.</li> </ul>
ar: <ul> <li><b>الموضع:</b> الموضع X/Y لمركز كتلة الصندوق، نسبة إلى مركز <a href="objinfo:World">العالم</a>.</li> <li><b>الزاوية:</b> مقدار دوران الصندوق في الاتجاه الموجب، وهو اتجاه عقارب الساعة.</li> <li><b>السرعة:</b> سرعة مركز كتلة الصندوق. الوحدة: متر/ثانية.</li> <li><b>السرعة الزاوية:</b> سرعة دوران الصندوق في الاتجاه الموجب، وهو اتجاه عقارب الساعة.</li> <li><b>الكتلة:</b> الكتلة الكلية للصندوق. يؤثر هذا على القوى التي يتفاعل بها الصندوق مع العناصر الأخرى.</li> <li><b>القصور الذاتي:</b> مدى صعوبة تغيير دوران الصندوق.</li> <li><b>كمية الحركة:</b> كمية أساسية في الميكانيكا محفوظة في غياب القوى الخارجية. ناتج ضرب الكتلة في السرعة.</li> <li><b>كمية الحركة الزاوية:</b> قياس المدى الذي سيستمر فيه الصندوق بالدوران ما لم تؤثر عليه عزوم خارجية.</li> <li><b>الطاقة الحركية:</b> الشغل اللازم لتسريع جسم له كتلة معينة من السكون إلى سرعته الحالية.</li> <li><b>الحجم:</b> يحدد عرض وارتفاع الصندوق.</li> </ul>
de: <ul> <li><b>Position:</b> Die X- und Y-Position des Massenzentrums des Rechtecks, relativ zum Zentrum der <a href="objinfo:World">Welt</a>.</li> <li><b>Winkel:</b> Winkel um den das Rechteck in positiver Richtung im Uhrzeigersinn gedreht ist.</li> <li><b>Geschwindigkeit:</b> Die Geschwindigkeit des Massenzentrums des Rechtecks in Meter/Sekunde.</li> <li><b>Winkelgeschwindigkeit:</b> Geschwindigkeit der Drehung des Rechteck in positiver Richtung im Uhrzeigersinn.</li> <li><b>Masse:</b> Gesamte Masse des Rechtecks. Die Masse beeinflusst die Kräfte, mit der das Teilchen auf andere Objekten wirkt.</li> <li><b>Trägheitsmoment:</b> Widerstand des Rechtecks gegen eine Änderung der Drehbewegung.</li> <li><b>Impuls:</b> Eine fundamentale Größe in der Mechanik, die ohne Einwirkung äußerer Kräfte unverändert bleibt. Der Impuls ist das Produkt von Masse und Geschwindigkeit.</li> <li><b>Drehimpuls:</b> Der Drehimpuls ist eine mechanische Messgröße für die Rotationsbewegung eines Objekts. Der Drehimpuls bleibt ohne Einwirkung eines äußeren Drehmomentes unverändert.</li> <li><b>Bewegungsenergie</b> Die Energie, die nötig ist, um einen Körper mit einer bestimmten Masse vom Ruhezustand bis zu seiner aktuellen Geschwindigkeit zu beschleunigen.</li> <li><b>Größe:</b> Bestimmt Breite und Höhe des Rechtecks.</li> </ul>
eo: <ul> <li><b>pozicio:</b> La X/Y-pozicio de la centro de maso de la kesto, relative al la centro de la <a href="objinfo:World ">mondo</a>.</li> <li><b>angulo:</b> Kiom la skatolo turniĝas en pozitiva direkto, tio estas horloĝe.</li> <li><b>rapideco:</b> La rapideco de la centro de maso de la skatolo. Unuo: metroj/sekundo.</li> <li><b>angula rapido:</b> Kiel rapide la skatolo turniĝas en pozitiva direkto, tio estas horloĝe.</li> <li><b>maso:</b> Tuta maso de la skatolo. Ĉi tio influas fortojn kun kiuj la skatolo interagas kun aliaj eroj.</li> <li><b>inercio:</b> Kiom malfacile estas ŝanĝi la rotacion de la skatolo.</li> <li><b>momento:</b> Fundamenta kvanto en mekaniko, kiu konserviĝas en foresto de eksteraj fortoj. Produto de la maso kaj la rapido.</li> <li><b>angula movokvanto:</b> Mezuro de la amplekso al kiu la skatolo daŭros rotacii krom se agado de ekstera tordmomanto.</li> <li><b>kineta energio:</b> La laboro necesa por akceli la korpon de difinita maso de ripozo ĝis ĝia nuna rapido.</li> t <li><b>grandeco:</b> Difinas larĝon kaj altecon de la skatolo.</li> </ul>

# chargedparticle.html:title
source: Charged Particle
ar: جسيم مشحون
de: Ladungsteilchen
eo: Ŝargita Partiklo

# chargedparticle.html:p
source: A zero-sized particle which carries an electric charge. It has a unique name and five parameters:
ar: جسيم صفر الحجم يحمل شحنة كهربائية. له اسم فريد وخمس معلمات:
de: Ein Teilchen ohne Ausdehnung mit elektrischer Ladung. Es hat einen eindeutigen Namen und fünf Parameter:
eo: Nul-granda partiklo kiu portas elektran ŝargon. Ĝi havas unikan nomon kaj kvin parametrojn:

# chargedparticle.html:body
source: <ul> <li><b>position:</b> The X/Y position of the particle, relative to the center of the <a href="objinfo:World">world</a>.</li> <li><b>velocity:</b> the velocity of the particle. Unit: meters/second.</li> <li><b>force:</b> the force with which the particle is moving around.</li> <li><b>mass:</b> the mass of the particle. This influences forces with which the particle interacts with other items.</li> <li><b>charge:</b> The amount of positive or negative electricity deposited on the particle. Unit: Coulomb.</li> </ul>
ar: <ul> <li><b>الموضع:</b> الموضع X/Y للجسيم، نسبة إلى مركز <a href="objinfo:World">العالم</a>.</li> <li><b>السرعة:</b> سرعة الجسيم. الوحدة: متر/ثانية.</li> <li><b>القوة:</b> القوة التي يتحرك بها الجسيم حوله.</li> <li><b>الكتلة:</b> كتلة الجسيم. يؤثر هذا على القوى التي يتفاعل بها الجسيم مع العناصر الأخرى.</li> <li><b>الشحنة:</b> مقدار الكهرباء الموجبة أو السالبة المترسبة على الجسيم. الوحدة: كولوم.</li> </ul>
de: <ul> <li><b>Position:</b> Die X- und Y-Position des Teilchens, relativ zum Zentrum der <a href="objinfo:World">Welt</a>.</li> <li><b>Geschwindigkeit:</b> Die Geschwindigkeit des Teilchen in Meter/Sekunde.</li> <li><b>Kraft:</b> Die Kraft mit der das Teilchen bewegt wird.</li> <li><b>Masse:</b> Die Masse des Teilchens. Sie beeinflusst die Kräfte, mit der das Teilchen auf andere Objekten wirkt.</li> <li><b>Ladung:</b> Die Menge an positiver oder negativer Energie auf dem Teilchen. Einheit: Coulomb.</li> </ul>
eo: <ul> <li><b>pozicio:</b> La X/Y pozicio de la partiklo, relative al la centro de la <a href="objinfo:World">mondo</a>.</li> <li><b>rapideco:</b> la rapideco de la partiklo. Unuo: metroj/sekundo.</li> <li><b>forto:</b> la forto per kiu la partiklo moviĝas ĉirkaŭe.</li> <li><b>maso:</b> la maso de la partiklo. Ĉi tio influas fortojn kun kiuj la partiklo interagas kun aliaj eroj.</li> <li><b>ŝarĝo:</b> La kvanto de pozitiva aŭ negativa elektro deponita sur la partiklo. Unuo: Kulombo.</li> </ul>

# coulombforce.html:title
source: Coulomb Force
ar: قوة كولوم
de: Coulomb-Kraft

# coulombforce.html:p
source: Coulomb force is a force of interaction between charged particles.
ar: قوة كولوم هي قوة تفاعل بين الجسيمات المشحونة.
de: Die Coulomb-Kraft tritt zwischen geladenen elektrischen Teilchen auf.
eo: Kulombia forto estas forto de interagado inter ŝarĝitaj partikloj.

# coulombforce.html:p
source: <b>Coulomb's law</b>
ar: <b>قانون كولوم</b>
de: <b>Coulombsches Gesetz</b>
eo: <b>Leĝo de Coulomb</b>

# coulombforce.html:body
source: <li>The magnitude of the electrostatic force between two point electric charges is directly proportional to the product of the magnitudes of each of the charges and inversely proportional to the square of the distance between the two charges.</li>
ar: <li>مقدار القوة الكهروستاتيكية بين شحنتين كهربائيتين نقطيتين يتناسب طرديًا مع حاصل ضرب مقادير كل من الشحنتين وعكسيًا مع مربع المسافة بين الشحنتين.</li>
de: <li>Die Größe dieser elektrostatischen Kraft zwischen geladenen Punktteilchen ist proportional zum Produkt der beiden Ladungsmengen und umgekehrt proportional zum Quadrat des Abstandes der Punkte.</li>
eo: <li>La grando de la elektrostatika forto inter du punktaj elektraj ŝargoj estas rekte proporcia al la produto de la grandoj de ĉiu el la ŝargoj kaj inverse proporcia al la kvadrato de la distanco inter la du ŝargoj.</li>

# coulombforce.html:p
source: For more details, please refer to the <a href="https://en.wikipedia.org/wiki/Coulomb's_law">Coulomb Force</a>.
ar: لمزيد من التفاصيل، يرجى الرجوع إلى <a href="https://en.wikipedia.org/wiki/Coulomb's_law">قوة كولوم</a>.
de: Weitere Informationen finden Sie unter <a href="http://de.wikipedia.org/wiki/Coulombsches_Gesetz">Coulombsches Gesetz</a>.
eo: Por pliaj detaloj, bonvolu raporti al la <a href="https://en.wikipedia.org/wiki/Coulomb's_law">Coulomb Force</a>.

# disk.html:title
source: Disk
ar: قرص
de: Scheibe
eo: Disko

# disk.html:p
source: A rigid disk with a unique name and the following parameters:
ar: قرص صلب له اسم فريد و المعلمات الآتية:
de: Eine starre Scheibe mit einem eindeutigen Namen und folgenden Parametern:
eo: Rigida disko kun unika nomo kaj la sekvaj parametroj:

# disk.html:body
source: <ul> <li><b>position:</b> The X/Y position of the center of mass of the disk, relative to the center of the <a href="objinfo:World">world</a>.</li> <li><b>angle:</b> By how much the disk is rotated in positive direction, that is clock-wise.</li> <li><b>velocity:</b> The velocity of the center of mass of the disk. Unit: meters/second.</li> <li><b>angular velocity:</b> How fast the disk is spinning in positive direction, that is clock-wise.</li> <li><b>mass:</b> Total mass of the disk. This influences forces with which the disk interacts with other items.</li> <li><b>inertia:</b> How difficult it is to change the disk's rotation.</li> <li><b>momentum:</b> A fundamental quantity in mechanics that is conserved in the absence of external forces. A product of the mass and the velocity.</li> <li><b>angular momentum:</b> Measure of the extent to which the disk will continue to rotate unless acted upon by an external torque.</li> <li><b>kinetic energy:</b> The work needed to accelerate the body of a given mass from rest to its current velocity.</li> <li><b>radius:</b> Defines how big the disk is.</li> </ul>
ar: <ul> <li><b>الموضع:</b> الموضع X/Y لمركز كتلة القرص، نسبة إلى مركز <a href="objinfo:World">العالم</a>.</li> <li><b>الزاوية:</b> مقدار دوران القرص في الاتجاه الموجب، وهو اتجاه عقارب الساعة.</li> <li><b>السرعة:</b> سرعة مركز كتلة القرص. الوحدة: متر/ثانية.</li> <li><b>السرعة الزاوية:</b> سرعة دوران القرص في الاتجاه الموجب، وهو اتجاه عقارب الساعة.</li> <li><b>الكتلة:</b> الكتلة الكلية للقرص. يؤثر هذا على القوى التي يتفاعل بها القرص مع العناصر الأخرى.</li> <li><b>القصور الذاتي:</b> مدى صعوبة تغيير دوران القرص.</li> <li><b>كمية الحركة:</b> كمية أساسية في الميكانيكا محفوظة في غياب القوى الخارجية. ناتج ضرب الكتلة في السرعة.</li> <li><b>كمية الحركة الزاوية:</b> قياس المدى الذي سيستمر فيه القرص بالدوران ما لم تؤثر عليه عزوم خارجية.</li> <li><b>الطاقة الحركية:</b> الشغل اللازم لتسريع جسم له كتلة معينة من السكون إلى سرعته الحالية.</li> <li><b>نصف القطر:</b> يحدد مدى كبر القرص.</li> </ul>
de: <ul> <li><b>Position:</b> Die X- und Y-Position des Massenzentrums der Scheibe, relativ zum Zentrum der <a href="objinfo:World">Welt</a>.</li> <li><b>Winkel:</b> Winkel um den die Scheibe in positiver Richtung im Uhrzeigersinn gedreht ist.</li> <li><b>Geschwindigkeit:</b> Die Geschwindigkeit des Massenzentrums der Scheibe in Meter/Sekunde</li> <li><b>Winkelgeschwindigkeit:</b> Geschwindigkeit der Drehung der Scheibe in positiver Richtung im Uhrzeigersinn.</li> <li><b>Masse:</b> Gesamte Masse der Scheibe. Die Masse beeinflusst die Kräfte, mit der das Teilchen auf andere Objekten wirkt.</li> <li><b>Trägheitsmoment:</b> Widerstand der Scheibe gegen eine Änderung der Drehbewegung.</li> <li><b>Impuls:</b> Eine fundamentale Größe in der Mechanik, die ohne Einwirkung äußerer Kräfte unverändert bleibt. Der Impuls ist das Produkt von Masse und Geschwindigkeit.</li> <li><b>Drehimpuls:</b> Der Drehimpuls ist eine mechanische Messgröße für die Rotationsbewegung eines Objekts. Der Drehimpuls bleibt ohne Einwirkung eines äußeren Drehmomentes unverändert.</li> <li><b>Bewegungsenergie:</b> Die Energie, die nötig ist, um einen Körper mit einer bestimmten Masse vom Ruhezustand bis zu seiner aktuellen Geschwindigkeit zu beschleunigen.</li> <li><b>Radius:</b> Bestimmt die Größe der Scheibe.</li> </ul>
eo: <ul> <li><b>pozicio:</b> La X/Y-pozicio de la centro de maso de la disko, relative al la centro de la <a href="objinfo:World ">mondo</a>.</li> <li><b>angulo:</b> Kiom la disko turniĝas en pozitiva direkto, tio estas horloĝe.</li> <li><b>rapideco:</b> La rapideco de la centro de maso de la disko. Unuo: metroj/sekundo.</li> <li><b>angula rapido:</b> Kiom rapide la disko turniĝas en pozitiva direkto, tio estas horloĝe.</li> <li><b>maso:</b> Tuta maso de la disko. Ĉi tio influas fortojn, kun kiuj la disko interagas kun aliaj eroj.</li> <li><b>inercio:</b> Kiel malfacile estas ŝanĝi la rotacion de la disko.</li> <li><b>momento:</b> Fundamenta kvanto en mekaniko, kiu konserviĝas en foresto de eksteraj fortoj. Produto de la maso kaj la rapido.</li> <li><b>angula movokvanto:</b> Mezuro de la amplekso al kiu la disko daŭre turniĝos krom se ĝi agas al ekstera. tordmomanto.</li> <li><b>kineta energio:</b> La laboro necesa por akceli la korpon de difinita maso de ripozo ĝis ĝia nuna rapido.</li> <li><b>radiuso:</b> Difinas kiom granda estas la disko.</li> </ul>

# gas.html:title
source: Gas
ar: غاز
eo: Gaso

# gas.html:p
source: A gas is a collection of <a href="objinfo:GasParticle">gasoline particles</a>. Associated with the gas is a <a href="objinfo:GasLJForce">force</a>. To add gas particles right-click the gas and click on "Create particles".
ar: الغاز هو مجموعة من <a href="objinfo:GasParticle">جسيمات الغاز</a>. تقترن بالغاز <a href="objinfo:GasLJForce">قوة</a>. لإضافة جسيمات غاز، انقر بالزر الأيمن على الغاز وانقر على "أنشئ جسيمات".
de: Ein Gas ist eine Ansammlung von <a href="objinfo:GasParticle">gasförmigen Teilchen</a>. Verbunden mit dem Gas ist eine <a href="objinfo:GasLJForce">Kraft</a>. Um Gasteilchen hinzuzufügen, klicken Sie mit der rechten Maustaste in den Gasbehälter und wählen dann „Teilchen erzeugen“.
eo: Gaso estas kolekto de <a href="objinfo:GasParticle">benzinaj partikloj</a>. Asociita kun la gaso estas <a href="objinfo:GasLJForce">forto</a>. Por aldoni gasajn partiklojn dekstre alklaku la gason kaj alklaku "Krei partiklojn".

# gas.html:p
source: For details about the math used to calculate the forces, please refer to the <a href="https://en.wikipedia.org/wiki/Lennard-Jones_potential">Lennard-Jones potential</a>.
ar: للتفاصيل حول الرياضيات المستعملة لحساب القوى، يرجى الرجوع إلى <a href="https://en.wikipedia.org/wiki/Lennard-Jones_potential">جهد لينارد-جونز</a>.
de: Details über die mathematischen Verfahren zur Berechnung dieser Kräfte finden Sie unter <a href="http://de.wikipedia.org/wiki/Lennard-Jones-Potential">Lennard-Jones-Potential</a>.
eo: Por detaloj pri la matematiko uzata por kalkuli la fortojn, bonvolu raporti al la <a href="https://en.wikipedia.org/wiki/Lennard-Jones_potential">Lennard-Jones-potencialo</a>.

# gasljforce.html:title
source: Force
ar: قوة
de: Kraft
eo: Forto

# gasljforce.html:p
source: This force simulates the <a href="https://en.wikipedia.org/wiki/Lennard-Jones_potential">Lennard-Jones potential</a>. There are three parameters for this force:
ar: تحاكي هذه القوة <a href="https://en.wikipedia.org/wiki/Lennard-Jones_potential">جهد لينارد-جونز</a>. هناك ثلاث معلمات لهذه القوة:
de: Diese Kraft simuliert das <a href="http://de.wikipedia.org/wiki/Lennard-Jones-Potential">Lennard-Jones-Potential</a>. Es gibt drei Parameter für diese Kraft:
eo: Ĉi tiu forto simulas la <a href="https://en.wikipedia.org/wiki/Lennard-Jones_potential">Lennard-Jones potencialon</a>. Estas tri parametroj por ĉi tiu forto:

# gasljforce.html:body
source: <ul> <li><b>depth:</b> The minimum value of the Lennard-Jones potential well</li> <li><b>rmin:</b> The distance from the origin to the minimum of the potential</li> <li><b>cutoff:</b> The distance, where the Lennard-Jones (LJ) potential is often truncated to save computational time</li> </ul>
ar: <ul> <li><b>العمق:</b> القيمة الدنيا لبئر جهد لينارد-جونز</li> <li><b>الحد الأدنى للمسافة (rmin):</b> المسافة من الأصل إلى الحد الأدنى للجهد</li> <li><b>القطع:</b> المسافة التي يُقصر عندها غالبًا جهد لينارد-جونز (LJ) لحفظ وقت الحساب</li> </ul>
de: <ul> <li><b>Tiefe:</b> Die Tiefe der Potentialmulde</li> <li><b>rmin:</b> Der Abstand des Energieminimums vom Ursprung</li> <li><b>Kürzungspunkt:</b> Der Punkt, an dem die Werte des Lennard-Jones-Potentials vernachlässigt werden, um die Berechnung zu vereinfachen und Rechenzeit einzusparen</li> </ul>
eo: <ul> <li><b>profundo:</b> La minimuma valoro de la potenciala puto de Lennard-Jones</li> <li><b>rmin:</b> La distanco de la origino al la minimumo de la potencialo</li> <li><b>tranĉo:</b> La distanco, kie la Lennard-Jones (LJ) potencialo ofte estas detranĉita por ŝpari komputan tempon</li> </ul>

# gasljforce.html:p
source: These parameters are empirical and are usually obtained from experiment or some rough estimation.
ar: هذه المعلمات تجريبية وتُحصل عليها عادةً من التجربة أو من بعض التقديرات التقريبية.
de: Alle Parameter sind experimentell und werden normalerweise in Experimenten oder aus groben Abschätzungen ermittelt.
eo: Tiuj parametroj estas empiriaj kaj estas kutime akiritaj de eksperimento aŭ iu malglata takso.

# gasparticle.html:title
source: Gas Particle
ar: جسيم غاز
de: Gasteilchen
eo: Gasa Partiklo

# gasparticle.html:p
source: A <a href="objinfo:Gas">gas</a> particle simulates one single particle in a gasoline system. Each particle is tracked individually and has a unique name and four parameters:
ar: يحاكي جسيم <a href="objinfo:Gas">الغاز</a> جسيمًا واحدًا منفردًا في نظام غازي. يُتتبع كل جسيم فرديًا وله اسم فريد وأربع معلمات:
de: Ein <a href="objinfo:Gas">Gas</a>teilchen simuliert ein einzelnes Teilchen in einem Gas. Jedes Teilchen wird einzeln verfolgt und hat einen eindeutigen Namen und vier Parametern:
eo: Partiklo <a href="objinfo:Gas">gaso</a> simulas unu solan partiklon en benzinsistemo. Ĉiu partiklo estas spurita individue kaj havas unikan nomon kaj kvar parametrojn:

# gasparticle.html:body
source: <ul> <li><b>position:</b> The X/Y position of the particle relative, to the center of the <a href="objinfo:World">world</a>.</li> <li><b>velocity:</b> the velocity of the particle. Unit: meters/second.</li> <li><b>force:</b> the force with which the particle is moving around.</li> <li><b>mass:</b> the mass of the particle. This influences forces with which the particle interacts with other items.</li> </ul>
ar: <ul> <li><b>الموضع:</b> الموضع X/Y للجسيم، نسبة إلى مركز <a href="objinfo:World">العالم</a>.</li> <li><b>السرعة:</b> سرعة الجسيم. الوحدة: متر/ثانية.</li> <li><b>القوة:</b> القوة التي يتحرك بها الجسيم حوله.</li> <li><b>الكتلة:</b> كتلة الجسيم. يؤثر هذا على القوى التي يتفاعل بها الجسيم مع العناصر الأخرى.</li> </ul>
de: <ul> <li><b>Position:</b> Die X- und Y-Position des Teilchens, relativ zum Zentrum der <a href="objinfo:World">Welt</a>.</li> <li><b>Geschwindigkeit:</b> Die Geschwindigkeit des Teilchen in Meter/Sekunde.</li> <li><b>Kraft:</b> Die Kraft mit der das Teilchen bewegt wird.</li> <li><b>Masse:</b> Die Masse des Teilchens. Sie beeinflusst die Kräfte, mit der das Teilchen auf andere Objekten wirkt.</li> </ul>
eo: <ul> <li><b>pozicio:</b> La X/Y pozicio de la partiklo relativa, al la centro de la <a href="objinfo:World">mondo</a>.</li> <li><b>rapideco:</b> la rapideco de la partiklo. Unuo: metroj/sekundo.</li> <li><b>forto:</b> la forto per kiu la partiklo moviĝas ĉirkaŭe.</li> <li><b>maso:</b> la maso de la partiklo. Ĉi tio influas fortojn kun kiuj la partiklo interagas kun aliaj eroj.</li> </ul>

# gravitationforce.html:title
source: Gravitation Force
ar: قوة الجاذبية
de: Gravitationskraft
eo: Gravita Forto

# gravitationforce.html:p
source: Gravitational force is an attractive force that act between bodies having mass.
ar: قوة الجاذبية هي قوة جذب تؤثر بين الأجسام التي لها كتلة.
de: Gravitationskraft ist eine anziehenden Kraft zwischen Körpern mit Masse.
eo: Gravita forto estas alloga forto kiu agas inter korpoj havantaj mason.

# gravitationforce.html:p
source: <b>Newton's law</b>
ar: <b>قانون نيوتن</b>
de: <b>Newtonsches Gravitationsgesetz</b>
eo: <b>Leĝo de Newton</b>

# gravitationforce.html:body
source: <li>Every body in the universe attracts every other body with a force, which is proportional to the product of the masses of the bodies and inversely proportional to square of the distance between them.</li>
ar: <li>كل جسم في الكون يجذب كل جسم آخر بقوة تتناسب طرديًا مع حاصل ضرب كتلتي الجسمين وعكسيًا مع مربع المسافة بينهما.</li>
de: <li>Jeder Körper im Universum zieht jeden anderen Körper mit einer Kraft an, die proportional zum Produkt der Massen der Körper und umgekehrt proportional zum Quadrat des Abstandes zwischen ihnen ist.</li>
eo: <li>Ĉiu korpo en la universo altiras ĉiun alian korpon per forto, kiu estas proporcia al la produto de la masoj de la korpoj kaj inverse proporcia al kvadrato de la distanco inter ili.</li>

# gravitationforce.html:p
source: <b>General relativity</b>
ar: <b>النسبية العامة</b>
de: <b>Allgemeine Relativitätstheorie</b>
eo: <b>Ĝenerala relativeco</b>

# gravitationforce.html:body
source: <li>In general relativity gravitation is explained on the basis of curvature of space-time.</li>
ar: <li>في النسبية العامة، يُشرح الجذب على أساس انحناء الزمكان.</li>
de: <li>Die allgemeine Relativitätstheorie deutet Gravitation als geometrische Eigenschaft der gekrümmten vierdimensionalen Raumzeit.</li>
eo: <li>Ĝenerale relativeco gravitado estas klarigita surbaze de kurbeco de spactempo.</li>

# gravitationforce.html:p
source: For more details, please refer to the <a href="https://en.wikipedia.org/wiki/Gravitation">Gravitation Force</a>.
ar: لمزيد من التفاصيل، يرجى الرجوع إلى <a href="https://en.wikipedia.org/wiki/Gravitation">قوة الجاذبية</a>.
de: Weitere Informationen finden Sie unter <a href="http://de.wikipedia.org/wiki/Gravitation">Gravitationskraft</a>.
eo: Por pliaj detaloj, bonvolu raporti al la <a href="https://en.wikipedia.org/wiki/Gravitation">Gravitation Force</a>.

# linearmotor.html:title
source: Linear Motor
ar: محرك خطي
eo: Lineara Motoro

# linearmotor.html:p
source: A linear motor produces a linear force along its length.
ar: ينتج المحرك الخطي قوة خطية على طوله.
de: Ein Linearmotor erzeugt eine gradlinige Kraft entlang seiner Richtung.
eo: Linia motoro produktas linearan forton laŭ sia longo.
