Repository: KDE/step
Catalog: po/*/step_example_files.po
Languages: ar, gl, pt_br

# HTML:p
source: - In order to create a body click on its icon in the Palette panel and follow the instructions given in the information widget in the top left corner of scene
ar: - لإنشاء جسم انقر على أيقونته في لوحة الألوان واتّبع التّعليمات المقدّمة في ودجة المعلومات في الزّاوية اليسرى العليا للمشهد
gl: - Para crear un corpo, prema a súa icona no panel da paleta e siga as indicacións do trebello de información que hai na esquina superior esquerda da escena.
pt_br: - Para criar um corpo, clique em seu ícone no painel Paleta e siga as instruções fornecidas no elemento de informações no canto superior esquerdo da cena.

# HTML:p
source: - Create one more disk and two more springs and connect all the items in the triangle. Now make them all spin around the center.
ar: - أنشئ قرصًا آخر ونابضين آخرين ووصل جميع العناصر في مثلّث. اجعلها الآن جميعها تدور حول المركز.
gl: - Cree un disco máis e dous resortes máis, e conecte todos os elementos do triángulo. Despois, faga que xiren arredor do centro.
pt_br: - Crie mais um disco e mais duas molas e conecte todos os itens no triângulo. Agora faça todos girarem em torno do centro.

# HTML:p
source: <span style=" font-weight:600;">Simulation</span>
ar: <span style=" font-weight:600;">المحاكاة</span>
gl: <span style=" font-weight:600;">Simulación</span>
pt_br: <span style=" font-weight:600;">Simulação</span>

# HTML:p
source: - Click on the "Simulate" button in the toolbar to start simulation. Click on the same button again to stop it.
ar: - انقر على زرّ "حاكي" في شريط الأدوات لبدء المحاكاة. انقر على الزّر نفسه مرّة أخرى لإيقافها.
gl: - Prema o botón «Simular» da barra de ferramentas para iniciar a simulación. Prema o mesmo botón de novo para detela.
pt_br: - Clique no botão "Simular" na barra de ferramentas para iniciar a simulação. Clique no mesmo botão novamente para interrompê-la.

# HTML:p
source: - After stopping the simulation you can revert to the initial state by pressing Undo button.
ar: - بعد إيقاف المحاكاة استعِد إلى الحالة المبدئيّة بالضّغط على زرّ تراجع.
gl: - Unha vez detida a simulación, pode devolvela ao estado inicial co botón «Desfacer».
pt_br: - Após interromper a simulação, você pode retornar ao estado inicial pressionando o botão Desfazer.

# HTML:p
source: <span style=" font-size:14pt; font-weight:600;">Tutorial 2</span>
ar: <span style=" font-size:14pt; font-weight:600;">دليل 2</span>
gl: <span style=" font-size:14pt; font-weight:600;">Titorial 1</span>

# HTML:p
source: <span style=" font-size:12pt;">Controllers and Graphs</span>
ar: <span style=" font-size:12pt;">أدوات التّحكّم والمخطّطات</span>
gl: <span style=" font-size:12pt;">Controladores e gráficos</span>
pt_br: <span style=" font-size:12pt;">Controladores e Gráficos</span>

# HTML:p
source: <span style=" font-weight:600;">Try it</span>
ar: <span style=" font-weight:600;">جرّب</span>
gl: <span style=" font-weight:600;">Próbeo</span>
pt_br: <span style=" font-weight:600;">Tente isto</span>

# HTML:p
source: - Change the stiffness of the spring by moving the slider just below the bodies. You can also change it by pressing "Q" and "W" keys!
ar: - غيّر صلابة النّابض بتحريك المنزلق الموجود أسفل الأجسام مباشرة. غيّرها كذلك بالضّغط على المفتاحين «ق» و «ث»!
gl: - Mova o control esvaradío que hai baixo os corpos para cambiar a rixidez do resorte. Tamén pode cambiala premendo as teclas «Q» ou «W»!
pt_br: - Altere a rigidez da mola movendo o controle deslizante logo abaixo dos corpos. Você também pode alterá-la pressionando as teclas "Q" e "W"!

# HTML:p
source: - Try changing it while the simulation is active and see how the graph will change.
ar: - حاول تغييرها أثناء نشاط المحاكاة وانظر كيف سيتغيّر المخطّط.
gl: - Probe a cambiala mentres a simulación está activa e observe como cambia o gráfico.
pt_br: - Tente alterá-lo enquanto a simulação estiver ativa e veja como o gráfico mudará.

# HTML:p
source: <span style=" font-weight:600;">Controller</span>
ar: <span style=" font-weight:600;">تحكّم</span>
gl: <span style=" font-weight:600;">Controlador</span>
pt_br: <span style=" font-weight:600;">Controlador</span>

# HTML:p
source: - Create a new controller on the scene.
ar: - أنشئ أداة تحكّم جديدة في المشهد.
gl: - Cree un novo controlador na escena.
pt_br: - Crie um novo controlador na cena.

# HTML:p
source: - Click on it with the right mouse button and choose "Configure controller" from the context menu.
ar: - انقر عليه بزرّ الفأرة الأيمن واختر "اضبط المتحكّم" من قائمة السّياق.
gl: - Prémao co botón dereito do rato e escolla «Configurar o controlador» no menú contextual.
pt_br: - Clique com o botão direito do mouse e escolha "Configurar controlador" no menu de contexto.

# HTML:p
source: - Select mass of the particle1 as the data source, adjust the range and assign keyboard shortcuts.
ar: - اختر كتلة الجسيم1 كمصدر للبيانات، واضبط النّطاق وخصص اختصارات لوحة المفاتيح.
gl: - Seleccione a masa de partícula1 como orixe dos datos, axuste o alcance e asigne os atallos de teclado.
pt_br: - Selecione a massa da partícula1 como fonte de dados, ajuste o intervalo e atribua atalhos de teclado.

# HTML:p
source: - Now try moving the slider and pressing the selected shortcuts while simulation is active.
ar: - حاول الآن تحريك المنزلق والضّغط على الاختصارات المحدّدة أثناء نشاط المحاكاة.
gl: - Agora probe a mover o control esvaradío e a premer os atallos seleccionados mentres a simulación está activa.
pt_br: - Agora tente mover o controle deslizante e pressionar os atalhos selecionados enquanto a simulação estiver ativa.

# HTML:p
source: <span style=" font-weight:600;">Graph</span>
ar: <span style=" font-weight:600;">مخطّط</span>
gl: <span style=" font-weight:600;">Gráfico</span>
pt_br: <span style=" font-weight:600;">Gráfico</span>

# HTML:p
source: - Create a graph for the velocity of particle1.
ar: - أنشئ مخطّطًا لسرعة الجسيم1.
gl: - Cree un gráfico da velocidade de partícula1.
pt_br: - Crie um gráfico para a velocidade da partícula1.

# HTML:p
source: - Place it below the position graph and make the ranges along X axis the same for the both graphs. See how the graphs relates to each other.
ar: - ضعه أسفل مخطّط الموضع واجعل النّطاقات على طول المحور السينيّ متطابقة لكلا المخطّطين. انظر كيف يرتبط المخطّطان ببعضهما البعض.
gl: - Colóqueo baixo o gráfico de posición e faga que o alcance no eixe X coincida nos dous gráficos. Observe a relación entre os gráficos.
pt_br: - Posicione-o abaixo do gráfico de posição e faça com que os intervalos ao longo do eixo X sejam iguais para ambos os gráficos. Veja como os gráficos se relacionam entre si.

# HTML:p
source: <span style=" font-size:14pt; font-weight:600;">Tutorial 3</span>
ar: <span style=" font-size:14pt; font-weight:600;">دليل 3</span>
gl: <span style=" font-size:14pt; font-weight:600;">Titorial 3</span>

# HTML:p
source: <span style=" font-size:12pt;">Rigid bodies and tracers</span>
ar: <span style=" font-size:12pt;">الأجسام الصّلبة وعلامات المسار</span>
gl: <span style=" font-size:12pt;">Corpos ríxidos e trazadores</span>
pt_br: <span style=" font-size:12pt;">Corpos rígidos e traçadores</span>

# HTML:p
source: <span style=" font-weight:600;">Angle and angular velocity</span>
ar: <span style=" font-weight:600;">الزّاوية والسّرعة الزّاويّة</span>
gl: <span style=" font-weight:600;">Ángulo e velocidade angular</span>
pt_br: <span style=" font-weight:600;">Ângulo e velocidade angular</span>

# HTML:p
source: - When the rigid body is selected you see three gray handlers on it. Using them you can change velocity, angle and angular velocity of the body.
ar: - عندما يُحدَّد الجسم الصّلب ترى ثلاثة مقابض رماديّة عليه. استخدمها لتغيير السّرعة والزّاوية والسّرعة الزّاويّة للجسم.
gl: - Ao seleccionar o corpo ríxido aparecerán tres asas grises sobre el. Pode usalas para cambiar a velocidade, o ángulo e a velocidade angular do corpo.
pt_br: - Quando o corpo rígido é selecionado, você vê três indicadores cinzas nele. Usando-os, você pode alterar a velocidade, o ângulo e a velocidade angular do corpo.

# HTML:p
source: <span style=" font-weight:600;">Tracer</span>
ar: <span style=" font-weight:600;">علامة مسار</span>
gl: <span style=" font-weight:600;">Trazador</span>
pt_br: <span style=" font-weight:600;">Traçador</span>

# HTML:p
source: - Tracer is a tool to show trajectory of a given point on a rigid body. Turn on the simulation to see it in action.
ar: - علامة المسار أداة لعرض مسار نقطة معيّنة على جسم صلب. شغّل المحاكاة لترى ذلك عمليًّا.
gl: - O trazador é unha ferramenta para amosar a traxectoria dun punto concreto dun corpo ríxido. Active a simulación para velo en acción.
pt_br: - O traçador é uma ferramenta para mostrar a trajetória de um determinado ponto em um corpo rígido. Ative a simulação para vê-la em ação.

# HTML:p
source: - Change various properties like spring stiffness and see how they affect the trajectory.
ar: - غيّر خصائص مختلفة مثل صلابة النّابض وانظر كيف تؤثّر على المسار.
gl: - Cambie varias propiedades, como a rixidez do resorte, e observe como afectan á traxectoria.
pt_br: - Altere várias propriedades, como a rigidez da mola, e veja como elas afetam a trajetória.

# HTML:p
source: - Attach one more tracer to the box and compare trajectories of different points.
ar: - أرفق علامة مسار أخرى بالصّندوق وقارن مسارات النّقاط المختلفة.
gl: - Conecte un ou máis trazadores á caixa e compare as traxectorias de distintos puntos.
pt_br: - Anexe mais um traçador à caixa e compare trajetórias de diferentes pontos.

# name
source: controller2
ar: تحكّم2
gl: controlador2
pt_br: controlador2

# HTML:p
source: <span style=" font-size:14pt; font-weight:600;">Tutorial 4</span>
ar: <span style=" font-size:14pt; font-weight:600;">دليل 4</span>
gl: <span style=" font-size:14pt; font-weight:600;">Titorial 4</span>

# HTML:p
source: <span style=" font-size:12pt;">Motors and forces</span>
ar: <span style=" font-size:12pt;">المحرّكات والقوى</span>
gl: <span style=" font-size:12pt;">Motores e forzas</span>
pt_br: <span style=" font-size:12pt;">Motores and forças</span>

# HTML:p
source: <span style=" font-weight:600;">Linear motor</span>
ar: <span style=" font-weight:600;">محرّك خطّيّ</span>
gl: <span style=" font-weight:600;">Motor linear</span>
pt_br: <span style=" font-weight:600;">Motor linear</span>

# HTML:p
source: - A linear motor applies a constant force to a given point on a body.
ar: - يطبّق محرّك خطّيّ قوّة ثابتة على نقطة معيّنة على جسم.
gl: - Un motor lineal aplica unha forza constante nun punto fixo do corpo.
pt_br: - Um motor linear aplica uma força constante a um determinado ponto de um corpo.

# HTML:p
source: - You can change the force by dragging its handler while the motor is selected.
ar: - غيّر القوّة عن طريق سحب مقبضها أثناء تحديد المحرّك.
gl: - Para cambiar a forza, seleccione o motor e arrastre o seu manexador.
pt_br: - Você pode alterar a força arrastando seu manipulador enquanto o motor estiver selecionado.

# HTML:p
source: - You can change the point of application by dragging the force
ar: - غيّر نقطة التّطبيق عن طريق سحب القوّة
gl: - Arrastre a forza para cambiar o punto de aplicación.
pt_br: - Você pode alterar o ponto de aplicação arrastando a força

# HTML:p
source: <span style=" font-weight:600;">Circular motor</span>
ar: <span style=" font-weight:600;">محرّك دائريّ</span>
gl: <span style=" font-weight:600;">Motor circular</span>
pt_br: <span style=" font-weight:600;">Motor circular</span>

# HTML:p
source: - A circular motor applies a constant angular momentum to a body.
ar: - يطبّق محرّك دائريّ زخمًا زاويًّا ثابتًا على جسم.
gl: - Un motor circular aplica un momento angular constante nun corpo.
pt_br: - Um motor circular aplica um momento angular constante a um corpo.

# HTML:p
source: - Try to attach a circular motor to the box and start simulation.
ar: - حاول إرفاق محرّك دائريّ بالصّندوق وابدأ المحاكاة.
gl: - Intente conectar un motor circular á caixa e inicie a simulación.
pt_br: - Tente conectar um motor circular à caixa e inicie a simulação.

# HTML:p
source: <span style=" font-weight:600;">Global forces</span>
ar: <span style=" font-weight:600;">القوى الشّاملة</span>
gl: <span style=" font-weight:600;">Forzas globais</span>
pt_br: <span style=" font-weight:600;">Forças globais</span>

# HTML:p
source: <span style=" font-weight:400;">- Global forces are forces that act on all bodies of a specific kind, for example weight force.</span>
ar: <span style=" font-weight:400;">- القوى الشّاملة قوى تؤثّر على جميع الأجسام من نوع معيّن، مثل قوّة الوزن.</span>
gl: <span style=" font-weight:400;">- As forzas globais actúan en todos os corpos dun tipo concreto, por exemplo a forza de peso.</span>
pt_br: <span style=" font-weight:400;">- Forças globais são forças que atuam sobre todos os corpos de um tipo específico, por exemplo, força peso.</span>

# HTML:p
source: - By default all global forces in Step are turned off. To turn them on, just add an object for appropriate force to the scene.
ar: - مبدئيًّا القوى الشّاملة في خطوة كلّها مطفأة. لتشغيلها أضف كائنًا للقوّة المناسبة إلى المشهد.
gl: - As forzas globais de Step están desactivadas de maneira predeterminada. Para activalas, engada un obxecto para a forza correspondente á escena.
pt_br: - Por padrão, todas as forças globais no Step estão desativadas. Para ativá-las, basta adicionar um objeto para a força apropriada à cena.

# HTML:p
source: - Try to add WeightForce to the scene and start the simulation.
ar: - حاول إضافة قوّة_وزن إلى المشهد وابدأ المحاكاة.
gl: - Intente engadir ForzaDePeso á escena e inicie a simulación.
pt_br: - Tente adicionar ForçadoPeso à cena e iniciar a simulação.

# name
source: box2
ar: صندوق2
gl: caixa2
pt_br: caixa2

# HTML:p
source: <span style=" font-size:14pt; font-weight:600;">Tutorial 5</span>
ar: <span style=" font-size:14pt; font-weight:600;">دليل 5</span>
gl: <span style=" font-size:14pt; font-weight:600;">Titorial 5</span>

# HTML:p
source: <span style=" font-size:12pt;">Joints</span>
ar: <span style=" font-size:12pt;">المفاصل</span>
gl: <span style=" font-size:12pt;">Articulacións</span>
pt_br: <span style=" font-size:12pt;">Articulações</span>

# HTML:p
source: - Create graphs to display coordinates of particles in double pendulum.
ar: - أنشئ مخطّطات لعرض إحداثيّات الجسيمات في الرّقاص المزدوج.
gl: - Cree gráficos para amosar as coordenadas de partículas no péndulo duplo.
pt_br: - Crie gráficos para exibir coordenadas de partículas em pêndulo duplo.

# HTML:p
source: - Create triple pendulum by attaching one more particle to the particle2 using the stick.
ar: - أنشئ رقّاصًا ثلاثيًّا بإرفاق جسيم آخر بالجسيم2 باستخدام العصا.
gl: - Para crear un péndulo triplo, conecte unha partícula máis á partícula2 usando o pau.
pt_br: - Crie um pêndulo triplo anexando mais uma partícula à partícula 2 usando o bastão.

# HTML:p
source: - Remove anchor1 that fixes position of the box and attach a pin to the corner of the box. Try starting the simulation.
ar: - أزل المرساة1 الّتي تثبّت موضع الصّندوق وأرفق مسمارًا بزاوية الصّندوق. حاول بدء المحاكاة.
gl: - Retire a áncora1 que fixa a posición da caixa e conecte un alfinete á esquina da caixa. Probe a iniciar a simulación.
pt_br: - Remova a âncora1 que fixa a posição da caixa e fixe um pino no canto da caixa. Tente iniciar a simulação.

# HTML:p
source: <span style=" font-weight:600;">Joints</span>
ar: <span style=" font-weight:600;">المفاصل</span>
gl: <span style=" font-weight:600;">Articulacións</span>
pt_br: <span style=" font-weight:600;">Articulações</span>

# HTML:p
source: <span style=" font-weight:400;">- Joints are objects that attach bodies to each other or to the background.</span>
ar: <span style=" font-weight:400;">- المفاصل كائنات تُرفق أجسامًا ببعضها أو بالخلفيّة.</span>
gl: <span style=" font-weight:400;">- As articulacións son obxectos que conectan corpos entre eles ou ao fondo.</span>
pt_br: <span style=" font-weight:400;">- Articulações são objetos que unem corpos uns aos outros ou ao fundo.</span>

# HTML:p
source: - An anchor is a joint that fixes the position of the body.
ar: - المرساة مفصل يثبّت موقع الجسم.
gl: - Unha áncora é unha articulación que fixa a posición do corpo.
pt_br: - Uma âncora é uma articulação que fixa a posição do corpo.

# HTML:p
source: - A pin is a joint that fixes one point of the body.
ar: - المسمار مفصل يثبّت نقطة واحدة من الجسم.
gl: - Un alfinete é unha articulación que fixa un punto do corpo.
pt_br: - Um pino é uma articulação que fixa um ponto do corpo.

# HTML:p
source: - A stick is a joint that fixes the distance between two points on two bodies.
ar: - العصا مفصل يثبّت المسافة بين نقطتين على جسمين.
gl: - Un pau é unha articulación que fixa a distancia entre dous puntos de dous corpos.
pt_br: - Um bastão é uma articulação que fixa a distância entre dois pontos em doiscorpos.
