Repository: KDE/step
Catalog: po/*/step_example_files.po
Languages: ar, gl, pt_br

# name
source: world1
ar: عالم1
gl: mundo1
pt_br: mundo1

# name
source: polygon1
ar: مضلع1
gl: polígono1
pt_br: polígono1

# name
source: polygon2
ar: مضلع2
gl: polígono2
pt_br: polígono2

# name
source: polygon3
ar: مضلع3
gl: polígono3
pt_br: polígono3

# name
source: polygon4
ar: مضلع4
gl: polígono4
pt_br: polígono4

# name
source: gas1
ar: غاز1
pt_br: gás1

# name
source: graph1
ar: مخطط1
gl: gráfico1
pt_br: gráfico1

# name
source: disk1
ar: قرص1
gl: disco1
pt_br: disco1

# name
source: tracer1
ar: علامة1
gl: trazador1
pt_br: traçador1

# name
source: solver1
ar: حل1
gl: resolvente1
pt_br: solucionador1

# name
source: collisionSolver1
ar: حل_تصادم1
gl: resolventeDeColisións1
pt_br: solucionadorColisão1

# name
source: constraintSolver1
ar: حل_قيود1
gl: resolventeDeRestricións1
pt_br: solucionadorRestrição1

# name
source: particle1
ar: جسيم1
gl: partícula1
pt_br: partícula1

# name
source: particle2
ar: جسيم2
gl: partícula2
pt_br: partícula2

# name
source: stick1
ar: عصا1
gl: pau1
pt_br: bastão1

# name
source: stick2
ar: عصا2
gl: pau2
pt_br: bastão2

# name
source: weightForce1
ar: قوة_وزن1
gl: forzaDePeso1
pt_br: forçadoPeso1

# name
source: note1
ar: ملاحظة1
gl: nota1
pt_br: nota1

# HTML:p
source: Double pendulum example
ar: مثال رقاص مزدوج
gl: Exemplo de péndulo duplo.
pt_br: Exemplo de pêndulo duplo

# name
source: Pendule de Newton à 8 billes (http://fr.wikipedia.org/wiki/Pendule_de_Newton)
ar: رقاص نيوتن ذو 8 كرات (http://fr.wikipedia.org/wiki/Pendule_de_Newton)
gl: Péndulo de Newton de 8 bólas (http://fr.wikipedia.org/wiki/Pendule_de_Newton)
pt_br: Pêndulo de Newton com 8 notas (http://fr.wikipedia.org/wiki/Pendule_de_Newton)

# name
source: disk2
ar: قرص2
gl: disco2
pt_br: disco2

# name
source: disk4
ar: قرص4
gl: disco4
pt_br: disco4

# name
source: stick3
ar: عصا3
gl: pau3
pt_br: bastão3

# name
source: anchor1
ar: مرساة1
gl: áncora1
pt_br: âncora1

# name
source: disk5
ar: قرص5
gl: disco5
pt_br: disco5

# name
source: stick4
ar: عصا4
gl: pau4
pt_br: bastão4

# name
source: disk6
ar: قرص6
gl: disco6
pt_br: disco6

# name
source: stick5
ar: عصا5
gl: pau5
pt_br: bastão5

# name
source: disk7
ar: قرص7
gl: disco7
pt_br: disco7

# name
source: stick6
ar: عصا6
gl: pau6
pt_br: bastão6

# name
source: disk8
ar: قرص8
gl: disco8
pt_br: disco8

# name
source: stick7
ar: عصا7
gl: pau7
pt_br: bastão7

# name
source: disk9
ar: قرص9
gl: disco9
pt_br: disco9

# name
source: stick8
ar: عصا8
gl: pau8
pt_br: bastão8

# name
source: box1
ar: صندوق1
gl: caixa1
pt_br: caixa1

# name
source: world
ar: عالم
gl: mundo
pt_br: mundo

# name
source: spring1
ar: نابض1
gl: resorte1
pt_br: mola1

# name
source: chargedParticle1
ar: جسيم_مُشحون1
gl: partículaCargada1
pt_br: partículaCarregada1

# name
source: chargedParticle2
ar: جسيم_مُشحون2
gl: partículaCargada2
pt_br: partículaCarregada2

# name
source: solver
ar: حل
gl: resolvente
pt_br: solucionador

# name
source: disk3
ar: قرص3
gl: disco3
pt_br: disco3

# name
source: gasLJForce1
ar: قوة_غاز_لينارد_جونز1
gl: forzaDeLJEnGas1
pt_br: forçaLJGás1

# name
source: gasParticle1
ar: جسيم_غاز1
gl: partículaDeGas1
pt_br: partículaGás1

# name
source: gasParticle2
ar: جسيم_غاز2
gl: partículaDeGas2
pt_br: partículaGás2

# name
source: gasParticle3
ar: جسيم_غاز3
gl: partículaDeGas3
pt_br: partículaGás3

# name
source: gasParticle4
ar: جسيم_غاز4
gl: partículaDeGas4
pt_br: partículaGás4

# name
source: gasParticle5
ar: جسيم_غاز5
gl: partículaDeGas5
pt_br: partículaGás5

# name
source: gasParticle6
ar: جسيم_غاز6
gl: partículaDeGas6
pt_br: partículaGás6

# name
source: gasParticle7
ar: جسيم_غاز7
gl: partículaDeGas7
pt_br: partículaGás7

# name
source: gasParticle8
ar: جسيم_غاز8
gl: partículaDeGas8
pt_br: partículaGás8

# name
source: gasParticle9
ar: جسيم_غاز9
gl: partículaDeGas9
pt_br: partículaGás9

# name
source: gasParticle10
ar: جسيم_غاز10
gl: partículaDeGas10
pt_br: partículaGás10

# name
source: gasParticle11
ar: جسيم_غاز11
gl: partículaDeGas11
pt_br: partículaGás11

# name
source: gasParticle12
ar: جسيم_غاز12
gl: partículaDeGas12
pt_br: partículaGás12

# name
source: gasParticle13
ar: جسيم_غاز13
gl: partículaDeGas13
pt_br: partículaGás13

# name
source: gasParticle14
ar: جسيم_غاز14
gl: partículaDeGas14
pt_br: partículaGás14

# name
source: gasParticle15
ar: جسيم_غاز15
gl: partículaDeGas15
pt_br: partículaGás15

# name
source: gasParticle16
ar: جسيم_غاز16
gl: partículaDeGas16
pt_br: partículaGás16

# name
source: gasParticle17
ar: جسيم_غاز17
gl: partículaDeGas17
pt_br: partículaGás17

# name
source: gasParticle18
ar: جسيم_غاز18
gl: partículaDeGas18
pt_br: partículaGás18

# name
source: gasParticle19
ar: جسيم_غاز19
gl: partículaDeGas19
pt_br: partículaGás19

# name
source: gasParticle20
ar: جسيم_غاز20
gl: partículaDeGas20
pt_br: partículaGás20

# HTML:p
source: <span style=" font-size:large;">n =</span>
ar: <span style=" font-size:large;">ن =</span>

# name
source: meter1
ar: مقياس1
gl: metro1
pt_br: medidor1

# name
source: meter2
ar: مقياس2
gl: metro2
pt_br: medidor2

# name
source: note3
ar: ملاحظة3
gl: nota3
pt_br: nota3

# HTML:h3
source: T =
ar: ح =

# name
source: meter3
ar: مقياس3
gl: metro3
pt_br: medidor3

# name
source: note2
ar: ملاحظة2
gl: nota2
pt_br: nota2

# HTML:h3
source: p =
ar: ض =

# name
source: note5
ar: ملاحظة5
gl: nota5
pt_br: nota5

# HTML:p
source: <span style=" font-size:large;">F</span><span style=" font-size:large; vertical-align:sub;">s</span><span style=" font-size:large;"> =</span>
ar: <span style=" font-size:large;">ق</span><span style=" font-size:large; vertical-align:sub;">ن</span><span style=" font-size:large;"> =</span>

# name
source: meter4
ar: مقياس4
gl: metro4
pt_br: medidor4

# name
source: note4
ar: ملاحظة4
gl: nota4
pt_br: nota4

# HTML:p
source: <span style=" font-size:medium;">Macroscopic quantities:</span>
ar: <span style=" font-size:medium;">الكمّيّات العيانيّة:</span>
gl: <span style=" font-size:medium;">Cantidades macroscópicas:</span>
pt_br: <span style=" font-size:medium;">Quantidades macroscópicas:</span>

# name
source: note6
ar: ملاحظة6
gl: nota6
pt_br: nota6

# HTML:p
source: <span style=" font-size:medium;">Spring tension:</span>
ar: <span style=" font-size:medium;">شدّ النّابض:</span>
gl: <span style=" font-size:medium;">Tensión do resorte:</span>
pt_br: <span style=" font-size:medium;">Tensão da mola:</span>

# name
source: note7
ar: ملاحظة7
gl: nota7
pt_br: nota7

# HTML:p
source: (run simulation for ~20 seconds and compare spring tension with pressure)
ar: (شغّل المحاكاة لحوالي 20 ثانية وقارن شدّ النّابض مع الضّغط)
gl: (executar a simulación durante uns 20 segundos e comparar a tensión do resorte coa presión)
pt_br: (execute a simulação por ~20 segundos e compare a tensão da mola com a pressão)

# name
source: graph2
ar: مخطط2
gl: gráfico2
pt_br: gráfico2

# HTML:p
source: Phase diagram
ar: مخطّط الطّور
gl: Diagrama de fase
pt_br: Diagrama de fase

# HTML:p
source: Position - time
ar: الموقع - الزّمن
gl: Posición — tempo
pt_br: Posição - tempo

# HTML:p
source: This small drop of liquid in free space is simulated using the same potential as gas. Notice how sometimes a particle leaves the drop - it is evaporation.
ar: هذه القطرة الصّغيرة من السّائل في الفضاء الحرّ تُحاكَى باستخدام نفس كمون الغاز. لاحظ كيف يغادر جسيم القطرة أحيانًا - هذا تبخّر.
gl: Esta pequena gota de líquido en espazo libre simúlase co mesmo potencial que o gas. Observe como ás veces unha partícula deixa unha gota; trátase de evaporación.
pt_br: Esta pequena gota de líquido no espaço livre é simulada usando o mesmo potencial do gás. Observe como às vezes uma partícula sai da gota - é evaporação.

# name
source: spring2
ar: نابض2
gl: resorte2
pt_br: mola2

# name
source: controller1
ar: تحكّم1
gl: controlador1
pt_br: controlador1

# HTML:p
source: Lissajous curve
ar: منحنى ليساجو
gl: Curva de Lissajous
pt_br: Curva de Lissajous

# HTML:p
source: Please try to change the stiffness of spring1 and see how the curve will change. Try the following values:<br></br>1, 2.25, 1.7778, 1.5625, 0.6944
ar: حاول أن تغيّر صلابة النّابض1 وانظر كيف سيتغيّر المنحنى. جرّب القيم التّالية:<br></br>1، 2.25، 1.7778، 1.5625، 0.6944
gl: Intente cambiar a rixidez do resorte1 e comprobe como cambia a curva. Probe os seguintes valores:<br></br>1, 2,25, 1,7778, 1,5625, 0,6944
pt_br: Tente alterar a rigidez da mola 1 e veja como a curva muda. Tente os seguintes valores: 1, 2,25, 1,7778, 1,5625, 0,6944

# name
source: linearMotor1
ar: محرّك_خطي1
gl: motorLineal1
pt_br: motorLinear1

# name
source: linearMotor2
ar: محرّك_خطي2
gl: motorLineal2
pt_br: motorLinear2

# name
source: linearMotor3
ar: محرّك_خطي3
gl: motorLineal3
pt_br: motorLinear3

# HTML:p
source: Example formula:
ar: صيغة مثال:
gl: Fórmula de exemplo:
pt_br: Fórmula de exemplo:

# HTML:p
source: Example image:
ar: صورة مثال:
gl: Imaxe de exemplo:
pt_br: Imagem de exemplo:

# name
source: img:0
ar: صورة:0

# name
source: img:1
ar: صورة:1

# name
source: LeftWall
ar: جدار_أيسر
gl: ParedeEsquerda
pt_br: ParedeEsquerda

# name
source: Body
ar: جسم
gl: Corpo
pt_br: Corpo

# name
source: RightWall
ar: جدار_أيمن
gl: ParedeDereita
pt_br: ParedeDireita

# name
source: Disk
ar: قرص
gl: Disco
pt_br: Disco

# name
source: PinDisk
ar: مسمار_قرص
gl: DiscoDeAlfinete
pt_br: DiscoPinos

# name
source: Spring
ar: نابض
gl: Resorte
pt_br: Mola

# name
source: AnchorLeftWall
ar: مرساة_الجدار_الأيسر
gl: ParedeEsquerdaDeÁncora
pt_br: ÂncoraParedeEsquerda

# name
source: AnchorRightWall
ar: مرساة_الجدار_الأيمن
gl: ParedeDereitaDeÁncora
pt_br: ÂncoraParedeDireita

# name
source: Graph
ar: مخطّط
gl: Gráfico
pt_br: Gráfico

# name
source: CircularMotor
ar: محرّك_دائري
gl: MotorCircular
pt_br: MotorCircular

# name
source: Velocity
ar: سرعة
gl: Velocidade
pt_br: Velocidade

# name
source: Acceleration
ar: تسارع
gl: Aceleración
pt_br: Aceleração

# name
source: Stiffness
ar: صلابة
gl: Rixidez
pt_br: Rigidez

# name
source: Damping
ar: تخميد
gl: Atenuación
pt_br: Amortecimento

# name
source: softBody1
ar: جسم_لين1
gl: corpoBrando1
pt_br: corpoMole1

# name
source: softBodyParticle1
ar: جسيم_الجسم_اللين1
gl: partículaDeCorpoBrando1
pt_br: corpoMolePartícula1

# name
source: softBodyParticle2
ar: جسيم_الجسم_اللين2
gl: partículaDeCorpoBrando2
pt_br: corpoMolePartícula2

# name
source: softBodyParticle3
ar: جسيم_الجسم_اللين3
gl: partículaDeCorpoBrando3
pt_br: corpoMolePartícula3

# name
source: softBodyParticle4
ar: جسيم_الجسم_اللين4
gl: partículaDeCorpoBrando4
pt_br: corpoMolePartícula4

# name
source: softBodyParticle5
ar: جسيم_الجسم_اللين5
gl: partículaDeCorpoBrando5
pt_br: corpoMolePartícula5

# name
source: softBodyParticle6
ar: جسيم_الجسم_اللين6
gl: partículaDeCorpoBrando6
pt_br: corpoMolePartícula6

# name
source: softBodyParticle7
ar: جسيم_الجسم_اللين7
gl: partículaDeCorpoBrando7
pt_br: corpoMolePartícula7

# name
source: softBodyParticle8
ar: جسيم_الجسم_اللين8
gl: partículaDeCorpoBrando8
pt_br: corpoMolePartícula8

# name
source: softBodyParticle9
ar: جسيم_الجسم_اللين9
gl: partículaDeCorpoBrando9
pt_br: corpoMolePartícula9

# name
source: softBodyParticle10
ar: جسيم_الجسم_اللين10
gl: partículaDeCorpoBrando10
pt_br: corpoMolePartícula10

# name
source: softBodyParticle11
ar: جسيم_الجسم_اللين11
gl: partículaDeCorpoBrando11
pt_br: corpoMolePartícula11

# name
source: softBodyParticle12
ar: جسيم_الجسم_اللين12
gl: partículaDeCorpoBrando12
pt_br: corpoMolePartícula12

# name
source: softBodyParticle13
ar: جسيم_الجسم_اللين13
gl: partículaDeCorpoBrando13
pt_br: corpoMolePartícula13

# name
source: softBodyParticle14
ar: جسيم_الجسم_اللين14
gl: partículaDeCorpoBrando14
pt_br: corpoMolePartícula14

# name
source: softBodyParticle15
ar: جسيم_الجسم_اللين15
gl: partículaDeCorpoBrando15
pt_br: corpoMolePartícula15

# name
source: softBodyParticle16
ar: جسيم_الجسم_اللين16
gl: partículaDeCorpoBrando16
pt_br: corpoMolePartícula16

# name
source: softBodySpring1
ar: نابض_الجسم_اللين1
gl: resorteDeCorpoBrando1
pt_br: corpoMoleMola1

# name
source: softBodySpring2
ar: نابض_الجسم_اللين2
gl: resorteDeCorpoBrando2
pt_br: corpoMoleMola2

# name
source: softBodySpring3
ar: نابض_الجسم_اللين3
gl: resorteDeCorpoBrando3
pt_br: corpoMoleMola3

# name
source: softBodySpring4
ar: نابض_الجسم_اللين4
gl: resorteDeCorpoBrando4
pt_br: corpoMoleMola4

# name
source: softBodySpring5
ar: نابض_الجسم_اللين5
gl: resorteDeCorpoBrando5
pt_br: corpoMoleMola5

# name
source: softBodySpring6
ar: نابض_الجسم_اللين6
gl: resorteDeCorpoBrando6
pt_br: corpoMoleMola6

# name
source: softBodySpring7
ar: نابض_الجسم_اللين7
gl: resorteDeCorpoBrando7
pt_br: corpoMoleMola7

# name
source: softBodySpring8
ar: نابض_الجسم_اللين8
gl: resorteDeCorpoBrando8
pt_br: corpoMoleMola8

# name
source: softBodySpring9
ar: نابض_الجسم_اللين9
gl: resorteDeCorpoBrando9
pt_br: corpoMoleMola9

# name
source: softBodySpring10
ar: نابض_الجسم_اللين10
gl: resorteDeCorpoBrando10
pt_br: corpoMoleMola10

# name
source: softBodySpring11
ar: نابض_الجسم_اللين11
gl: resorteDeCorpoBrando11
pt_br: corpoMoleMola11

# name
source: softBodySpring12
ar: نابض_الجسم_اللين12
gl: resorteDeCorpoBrando12
pt_br: corpoMoleMola12

# name
source: softBodySpring13
ar: نابض_الجسم_اللين13
gl: resorteDeCorpoBrando13
pt_br: corpoMoleMola13

# name
source: softBodySpring14
ar: نابض_الجسم_اللين14
gl: resorteDeCorpoBrando14
pt_br: corpoMoleMola14

# name
source: softBodySpring15
ar: نابض_الجسم_اللين15
gl: resorteDeCorpoBrando15
pt_br: corpoMoleMola15

# name
source: softBodySpring16
ar: نابض_الجسم_اللين16
gl: resorteDeCorpoBrando16
pt_br: corpoMoleMola16

# name
source: softBodySpring17
ar: نابض_الجسم_اللين17
gl: resorteDeCorpoBrando17
pt_br: corpoMoleMola17

# name
source: softBodySpring18
ar: نابض_الجسم_اللين18
gl: resorteDeCorpoBrando18
pt_br: corpoMoleMola18

# name
source: softBodySpring19
ar: نابض_الجسم_اللين19
gl: resorteDeCorpoBrando19
pt_br: corpoMoleMola19

# name
source: softBodySpring20
ar: نابض_الجسم_اللين20
gl: resorteDeCorpoBrando20
pt_br: corpoMoleMola20

# name
source: softBodySpring21
ar: نابض_الجسم_اللين21
gl: resorteDeCorpoBrando21
pt_br: corpoMoleMola21

# name
source: softBodySpring22
ar: نابض_الجسم_اللين22
gl: resorteDeCorpoBrando22
pt_br: corpoMoleMola22

# name
source: softBodySpring23
ar: نابض_الجسم_اللين23
gl: resorteDeCorpoBrando23
pt_br: corpoMoleMola23

# name
source: softBodySpring24
ar: نابض_الجسم_اللين24
gl: resorteDeCorpoBrando24
pt_br: corpoMoleMola24

# name
source: softBodySpring25
ar: نابض_الجسم_اللين25
gl: resorteDeCorpoBrando25
pt_br: corpoMoleMola25

# name
source: softBodySpring26
ar: نابض_الجسم_اللين26
gl: resorteDeCorpoBrando26
pt_br: corpoMoleMola26

# name
source: softBodySpring27
ar: نابض_الجسم_اللين27
gl: resorteDeCorpoBrando27
pt_br: corpoMoleMola27

# name
source: softBodySpring28
ar: نابض_الجسم_اللين28
gl: resorteDeCorpoBrando28
pt_br: corpoMoleMola28

# name
source: softBodySpring29
ar: نابض_الجسم_اللين29
gl: resorteDeCorpoBrando29
pt_br: corpoMoleMola29

# name
source: softBodySpring30
ar: نابض_الجسم_اللين30
gl: resorteDeCorpoBrando30
pt_br: corpoMoleMola30

# name
source: softBodySpring31
ar: نابض_الجسم_اللين31
gl: resorteDeCorpoBrando31
pt_br: corpoMoleMola1

# name
source: softBodySpring32
ar: نابض_الجسم_اللين32
gl: resorteDeCorpoBrando32
pt_br: corpoMoleMola32

# name
source: softBodySpring33
ar: نابض_الجسم_اللين33
gl: resorteDeCorpoBrando33
pt_br: corpoMoleMola33

# name
source: softBodySpring34
ar: نابض_الجسم_اللين34
gl: resorteDeCorpoBrando34
pt_br: corpoMoleMola34

# name
source: softBodySpring35
ar: نابض_الجسم_اللين35
gl: resorteDeCorpoBrando35
pt_br: corpoMoleMola35

# name
source: softBodySpring36
ar: نابض_الجسم_اللين36
gl: resorteDeCorpoBrando36
pt_br: corpoMoleMola36

# name
source: softBodySpring37
ar: نابض_الجسم_اللين37
gl: resorteDeCorpoBrando37
pt_br: corpoMoleMola37

# name
source: softBodySpring38
ar: نابض_الجسم_اللين38
gl: resorteDeCorpoBrando38
pt_br: corpoMoleMola38

# name
source: softBodySpring39
ar: نابض_الجسم_اللين39
gl: resorteDeCorpoBrando39
pt_br: corpoMoleMola39

# name
source: softBodySpring40
ar: نابض_الجسم_اللين40
gl: resorteDeCorpoBrando40
pt_br: corpoMoleMola40

# name
source: softBodySpring41
ar: نابض_الجسم_اللين41
gl: resorteDeCorpoBrando41
pt_br: corpoMoleMola1

# name
source: softBodySpring42
ar: نابض_الجسم_اللين42
gl: resorteDeCorpoBrando42
pt_br: corpoMoleMola42

# name
source: Solar System
ar: نظام_شمسي
gl: Sistema Solar
pt_br: Sistema solar

# name
source: Sun
ar: شمس
gl: Sol
pt_br: Sol

# name
source: Mercury
ar: عطارد
gl: Mercurio
pt_br: Mercúrio

# name
source: Venus
ar: زهرة
pt_br: Vênus

# name
source: Earth
ar: أرض
gl: Terra
pt_br: Terra

# name
source: Mars
ar: مرّيخ
gl: Marte
pt_br: Marte

# name
source: Jupiter
ar: مشتري
gl: Xúpiter
pt_br: Júpiter

# name
source: Saturn
ar: زحل
gl: Saturno
pt_br: Saturno

# name
source: Uranus
ar: أورانوس
gl: Urano
pt_br: Urano

# name
source: Neptune
ar: نبتون
gl: Neptuno
pt_br: Netuno

# name
source: Pluto
ar: بلوتو
gl: Plutón
pt_br: Plutão

# name
source: World
ar: عالم
gl: Mundo
pt_br: Mundo

# name
source: p1
ar: ج1

# name
source: p2
ar: ج2

# name
source: p3
ar: ج3

# name
source: p4
ar: ج4

# name
source: p5
ar: ج5

# name
source: s1
ar: ن1

# name
source: s2
ar: ن2

# name
source: s3
ar: ن3

# name
source: s4
ar: ن4

# name
source: Solver
ar: حل
gl: Resolvente
pt_br: Solucionador

# name
source: softBodyParticle17
ar: جسيم_الجسم_اللين17
gl: partículaDeCorpoBrando17
pt_br: corpoMolePartícula17

# name
source: softBodyParticle18
ar: جسيم_الجسم_اللين18
gl: partículaDeCorpoBrando18
pt_br: corpoMolePartícula18

# name
source: softBodyParticle19
ar: جسيم_الجسم_اللين19
gl: partículaDeCorpoBrando19
pt_br: corpoMolePartícula19

# name
source: softBodyParticle20
ar: جسيم_الجسم_اللين20
gl: partículaDeCorpoBrando20
pt_br: corpoMolePartícula20

# HTML:p
source: When you start simulation the wave starts to travel from the red particle. The blue particle will reflect the wave and it will travel in reverse direction until the red particle reflects in again. After some time the wave will vanish because springs have damping.
ar: عند بدء المحاكاة تبدأ الموجة بالسّفر من الجسيم الأحمر. يعكس الجسيم الأزرق الموجة وتسافر في الاتّجاه المعاكس حتّى يعكسها الجسيم الأحمر مجدّدًا. بعد بعض الوقت تختفي الموجة بسبب تخميد النّوابض.
gl: Cando inicia unha simulación, a onda comeza unha viaxe desde a partícula vermella. A partícula azul reflectirá a onda e viaxará en dirección oposta ata que a partícula vermella a reflicta de novo. Pasado un tempo, a onda esvaerá porque os resortes teñen atenuación.
pt_br: Quando você iniciar a simulação, a onda começa a viajar a partir da partícula vermelha. A partícula azul irá refletir a onda e irá viajar no sentido inverso até que a partícula vermelha a reflita novamente. Após algum tempo, a onda irá desaparecer porque as espirais têm amortecimento.

# HTML:p
source: The graph shows oscillations of the green particle
ar: يعرض المخطّط اهتزازات الجسيم الأخضر
gl: O gráfico amosa as oscilacións da partícula verde.
pt_br: O gráfico mostra as oscilações da partícula verde

# HTML:p
source: <span style=" font-size:14pt; font-weight:600;">Tutorial 1</span>
ar: <span style=" font-size:14pt; font-weight:600;">دليل 1</span>
gl: <span style=" font-size:14pt; font-weight:600;">Titorial 1</span>

# HTML:p
source: <span style=" font-size:12pt;">Bodies and springs.</span>
ar: <span style=" font-size:12pt;">الأجسام والنّوابض.</span>
gl: <span style=" font-size:12pt;">Corpos e resortes.</span>
pt_br: <span style=" font-size:12pt;">Corpos e molas.</span>

# HTML:p
source: <span style=" font-weight:600;">Position and velocity</span>
ar: <span style=" font-weight:600;">الموقع والسّرعة</span>
gl: <span style=" font-weight:600;">Posición e velocidade</span>
pt_br: <span style=" font-weight:600;">Posição e velocidade</span>

# HTML:p
source: - You can change position of any body simply by dragging it.
ar: - غيّر موقع أيّ جسم ببساطة عن طريق سحبه.
gl: - Pode arrastrar calquera corpo para cambiar a súa posición.
pt_br: - Você pode mudar a posição de qualquer corpo simplesmente arrastando-o.

# HTML:p
source: - Click on one of the disks to select it. Now you can see two arrows on it: blue arrow depicts the velocity and red arrow depicts the acceleration. You can drag the little gray square at the end of the velocity arrow to change the velocity.
ar: - انقر على أحد الأقراص لتحديده. ترى الآن سهمين عليه: السّهم الأزرق يصف السّرعة والسّهم الأحمر يصف التّسارع. اسحب المربّع الرّماديّ الصّغير في نهاية سهم السّرعة لتغيير السّرعة.
gl: - Prema un dos discos para seleccionalo. A continuación verá dúas frechas sobre el: a azul indica a velocidade e a vermella a aceleración. Pode arrastrar o cadradiño gris ao final da frecha de velocidade para cambiar a velocidade.
pt_br: - Clique em um dos discos para selecioná-lo. Agora você verá duas setas nele: a seta azul representa a velocidade e a seta vermelha representa a aceleração. Você pode arrastar o pequeno quadrado cinza no final da seta de velocidade para alterar a velocidade.

# HTML:p
source: - Take a look at the Properties panel on the right. Here you can numerically set position and velocity (as well as all other properties) for the current body.
ar: - ألقِ نظرة على لوحة الخصائص على اليمين. هنا اضبط موقع وسرعة (وكذلك جميع الخصائص الأخرى) للجسم الحاليّ عدديًّا.
gl: - Observe o panel de propiedades da dereita. Permítelle definir o valor da posición e da velocidade do corpo actual, así como outras propiedades.
pt_br: - Observe o painel de Propriedades à direita. Aqui você pode definir numericamente a posição e a velocidade (assim como todas as outras propriedades) para o corpo atual.

# HTML:p
source: <span style=" font-weight:600;">Properties</span>
ar: <span style=" font-weight:600;">الخصائص</span>
gl: <span style=" font-weight:600;">Propiedades</span>
pt_br: <span style=" font-weight:600;">Propriedades</span>

# HTML:p
source: - Select a spring by clicking on it. Change its stiffness and see how it is affecting the simulation.
ar: - حدّد نابضًا بالنّقر عليه. غيّر صلابته وانظر كيف يؤثّر على المحاكاة.
gl: - Para seleccionar un resorte, prémao. Cambie a súa rixidez para observar como afecta á simulación.
pt_br: - Selecione uma mola clicando nela. Altere sua rigidez e veja como isso afeta a simulação.

# HTML:p
source: <span style=" font-weight:600;">Quest</span>
ar: <span style=" font-weight:600;">مهمّة</span>
gl: <span style=" font-weight:600;">Misión</span>
pt_br: <span style=" font-weight:600;">Tarefas</span>

# HTML:p
source: - Try to change the system in a way to make the disks spining around the center of the system.
ar: - حاول تغيير النّظام بطريقة تجعل الأقراص تدور حول مركز النّظام.
gl: - Intente cambiar o sistema de forma que os discos xiren arredor do centro do sistema.
pt_br: - Tente mudar o sistema de forma a fazer os discos girarem em torno do centro do sistema.

# HTML:p
source: - Now try to change the properties of the spring in order to make its length constant while the disks are spinning.
ar: - حاول الآن تغيير خصائص النّابض لجعل طوله ثابتًا بينما تدور الأقراص.
gl: - Agora intente cambiar as propiedades do resorte para facer a súa lonxitude constante mentres xiran os discos.
pt_br: - Agora tente alterar as propriedades da mola para tornar seu comprimento constante enquanto os discos giram.

# HTML:p
source: <span style=" font-weight:600;">More bodies</span>
ar: <span style=" font-weight:600;">المزيد من الأجسام</span>
gl: <span style=" font-weight:600;">Máis corpos</span>
pt_br: <span style=" font-weight:600;">Mais corpos</span>
